# Dataframe

In [1]:
# import csv file using pandas

import pandas as pd
df = pd.read_csv("D:\Python\B17.csv")
df

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0          ITC   269686.78       1230.88  20  10.00      9.58       46.73
1  Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30
3      Infosys   576659.14        426.07  32  41.44      0.00      156.89
4          Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [2]:
df.shape

(5, 7)

In [3]:
row , columns = df.shape

In [4]:
row

5

In [5]:
columns

7

In [6]:
df.head()

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0          ITC   269686.78       1230.88  20  10.00      9.58       46.73
1  Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30
3      Infosys   576659.14        426.07  32  41.44      0.00      156.89
4          Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [7]:
df.head(3)

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0          ITC   269686.78       1230.88  20  10.00      9.58       46.73
1  Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30

In [8]:
df.tail(2)

      Name  Market Cap  No.of.Shares  PE    Eps  Debt  Book Value
3  Infosys   576659.14        426.07  32  41.44   0.0      156.89
4      Tcs  1173989.84        375.00  37  82.65   0.0      222.10

In [9]:
df[1:3]

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
1  Adani Power    41153.54        385.69   0  -0.59  14371.57        40.7
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77        45.3

In [10]:
df.columns

Index(['Name', 'Market Cap', 'No.of.Shares', 'PE', 'Eps', 'Debt',
       'Book Value'],
      dtype='object')

In [11]:
df['Name']

0            ITC
1    Adani Power
2    Tata Motors
3        Infosys
4            Tcs
Name: Name, dtype: object

In [12]:
type(df['Name'])

pandas.core.series.Series

In [13]:
df[['Name','Debt']]

          Name      Debt
0          ITC      9.58
1  Adani Power  14371.57
2  Tata Motors  25444.77
3      Infosys      0.00
4          Tcs      0.00

In [14]:
df['Eps'].max()

82.65

In [15]:
df[df['Debt']>0]

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0          ITC   269686.78       1230.88  20  10.00      9.58       46.73
1  Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30

In [16]:
df['Name'][df['Eps'] == df['Eps'].max()]

4    Tcs
Name: Name, dtype: object

In [18]:
df[df['Eps'] == df['Eps'].max()]

  Name  Market Cap  No.of.Shares  PE    Eps  Debt  Book Value
4  Tcs  1173989.84         375.0  37  82.65   0.0       222.1

In [19]:
df['Eps'].std()

42.11222708430415

In [20]:
df['Name'].max()

'Tcs'

In [21]:
df.describe()

,Market Cap,No.of.Shares,PE,Eps,Debt,Book Value
count,5.000000e+00,5.000000,5.000000,5.000000,5.000000,5.000000
mean,4.322728e+05,549.928000,17.800000,21.332000,7965.184000,102.344000
std,4.639204e+05,382.133147,17.383901,42.112227,11584.015448,82.860852
min,4.115354e+04,332.000000,0.000000,-26.840000,0.000000,40.700000
25%,9.987486e+04,375.000000,0.000000,-0.590000,0.000000,45.300000
50%,2.696868e+05,385.690000,20.000000,10.000000,9.580000,46.730000
75%,5.766591e+05,426.070000,32.000000,41.440000,14371.570000,156.890000
max,1.173990e+06,1230.880000,37.000000,82.650000,25444.770000,222.100000

In [22]:
# Changing the index inplace of true because it remain fix until change

df.set_index('Name', inplace=True)

In [23]:
df

             Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
Name
ITC           269686.78       1230.88  20  10.00      9.58       46.73
Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30
Infosys       576659.14        426.07  32  41.44      0.00      156.89
Tcs          1173989.84        375.00  37  82.65      0.00      222.10

In [24]:
df.index

Index(['ITC', 'Adani Power', 'Tata Motors', 'Infosys', 'Tcs'], dtype='object', name='Name')

In [25]:
df.loc['Tcs']

Market Cap      1173989.84
No.of.Shares        375.00
PE                   37.00
Eps                  82.65
Debt                  0.00
Book Value          222.10
Name: Tcs, dtype: float64

In [26]:
# changing index to original state inplace of true because it remain fix until change

df.reset_index(inplace=True)
df.head()

          Name  Market Cap  No.of.Shares  PE    Eps      Debt  Book Value
0          ITC   269686.78       1230.88  20  10.00      9.58       46.73
1  Adani Power    41153.54        385.69   0  -0.59  14371.57       40.70
2  Tata Motors    99874.86        332.00   0 -26.84  25444.77       45.30
3      Infosys   576659.14        426.07  32  41.44      0.00      156.89
4          Tcs  1173989.84        375.00  37  82.65      0.00      222.10

In [27]:
df.set_index('Book Value',inplace=True)
df

                   Name  Market Cap  No.of.Shares  PE    Eps      Debt
Book Value
46.73               ITC   269686.78       1230.88  20  10.00      9.58
40.70       Adani Power    41153.54        385.69   0  -0.59  14371.57
45.30       Tata Motors    99874.86        332.00   0 -26.84  25444.77
156.89          Infosys   576659.14        426.07  32  41.44      0.00
222.10              Tcs  1173989.84        375.00  37  82.65      0.00

In [28]:
df.loc[40.70]

Name            Adani Power
Market Cap          41153.5
No.of.Shares         385.69
PE                        0
Eps                   -0.59
Debt                14371.6
Name: 40.7, dtype: object

In [29]:
# changing index to original state inplace of true because it remain fix until change

df.reset_index(inplace=True)
df.head()

   Book Value         Name  Market Cap  No.of.Shares  PE    Eps      Debt
0       46.73          ITC   269686.78       1230.88  20  10.00      9.58
1       40.70  Adani Power    41153.54        385.69   0  -0.59  14371.57
2       45.30  Tata Motors    99874.86        332.00   0 -26.84  25444.77
3      156.89      Infosys   576659.14        426.07  32  41.44      0.00
4      222.10          Tcs  1173989.84        375.00  37  82.65      0.00